feat(diagramming): Migrate core diagramming from PlantUML to D2
